In [20]:
# Setup environment

##### https://www.youtube.com/watch?v=h4hOPGo4UVU&list=PLeo1K3hjS3uuASpe-1LjfG5f14Bnozjwy&index=9

In [4]:
import pandas as pd
import numpy as np

In [6]:
df1 = pd.DataFrame({
    'city':['New York','chicago','orlando'],
    'temprature':[21,14,35]
})
df1

       city  temprature
0  New York          21
1   chicago          14
2   orlando          35

In [13]:
df2 = pd.DataFrame({
    'city':['New York','chicago','orlando'],
    'humidity':[65,68,75]
})
df2

       city  humidity
0  New York        65
1   chicago        68
2   orlando        75

In [15]:
# The merge functions takes the list of the datasets and the column onto the merge will be done

df3 = pd.merge(df1,df2,on='city')

df3

       city  temprature  humidity
0  New York          21        65
1   chicago          14        68
2   orlando          35        75

In [25]:
# What happens the city listing has a mismatch ?
df1 = pd.DataFrame({
    'city':['New York','chicago','orlando','baltimore'],
    'temprature':[21,14,35,32]
})

df2 = pd.DataFrame({
    'city':['New York','chicago','san francisco'],
    'humidity':[65,68,75]
})

# InnerJoin : intersection of both sets based on the join column
df3 = pd.merge(df1,df2,on='city')

print(f"InnerJoin \n{df3}")
# Have you figured out something? Behaving like database innerjoin

#Outerjoin : Union of both the sets on a column, if the column is null; NaN will be written
df3 = pd.merge(df1,df2,on='city',how='outer')

print(f"OuterJoin \n{df3}")

#Left Join : All left values even those are null for the column; NaN will be written
df3 = pd.merge(df1,df2,on='city',how='left')

print(f"Left join \n{df3}")

#Right Join : All left values even those are null for the column; NaN will be written
df3 = pd.merge(df1,df2,on='city',how='right')

print(f"Right join \n{df3}")

InnerJoin
       city  temprature  humidity
0  New York          21        65
1   chicago          14        68
OuterJoin
            city  temprature  humidity
0       New York        21.0      65.0
1        chicago        14.0      68.0
2        orlando        35.0       NaN
3      baltimore        32.0       NaN
4  san francisco         NaN      75.0
Left join
        city  temprature  humidity
0   New York          21      65.0
1    chicago          14      68.0
2    orlando          35       NaN
3  baltimore          32       NaN
Right join
            city  temprature  humidity
0       New York        21.0        65
1        chicago        14.0        68
2  san francisco         NaN        75

In [28]:
# Sometimes its confusing that which value comes from which dataframe, espcially when 
# it is outer join
# we can debug with a flag 'indicator=True'
#Outerjoin : Union of both the sets on a column, if the column is null; NaN will be written
df3 = pd.merge(df1,df2,on='city',how='outer',indicator=True)

df3

            city  temprature  humidity      _merge
0       New York        21.0      65.0        both
1        chicago        14.0      68.0        both
2        orlando        35.0       NaN   left_only
3      baltimore        32.0       NaN   left_only
4  san francisco         NaN      75.0  right_only